БухЭксп/InformationRegisters/CW_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ШаблоныУслуг</Name>
			<Comment>Шаблоны услуг для подстановки в документы клиентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонАнглийский</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор либо приложение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасходнаяСтатья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоходнаяСтатья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ШаблоныУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьШаблронУслуги(ПараметрыОтбора) Экспорт
	
	мДоговора = Новый Массив;
	мДоговора.Добавить(Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка());
	
	Если ПараметрыОтбора.ДоговорУказан Тогда
		мДоговора.Добавить(ПараметрыОтбора.ДоговорПоГрузоперевозке);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ШаблоныУслуг.Договор КАК Договор,
	               |	CW_ШаблоныУслуг.Номенклатура КАК Номенклатура,
	               |	CW_ШаблоныУслуг.Шаблон КАК Шаблон,
	               |	CW_ШаблоныУслуг.ШаблонАнглийский КАК ШаблонАнглийский
	               |ИЗ
	               |	РегистрСведений.CW_ШаблоныУслуг КАК CW_ШаблоныУслуг
	               |ГДЕ
	               |	CW_ШаблоныУслуг.Договор В(&мДоговора)
	               |	И ВЫБОР
	               |			КОГДА &УказанДоговор
	               |				ТОГДА ВЫБОР
	               |						КОГДА &СПостащиком
	               |							ТОГДА CW_ШаблоныУслуг.РасходнаяСтатья
	               |						ИНАЧЕ CW_ШаблоныУслуг.ДоходнаяСтатья
	               |					КОНЕЦ
	               |			ИНАЧЕ CW_ШаблоныУслуг.ДоходнаяСтатья
	               |		КОНЕЦ
	               |	И CW_ШаблоныУслуг.Номенклатура = &Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Договор УБЫВ";
	
	Запрос.УстановитьПараметр("мДоговора"		, мДоговора);
	Запрос.УстановитьПараметр("Номенклатура"	, ПараметрыОтбора.Номенклатура);
	Запрос.УстановитьПараметр("УказанДоговор"	, ПараметрыОтбора.ДоговорУказан);
	Запрос.УстановитьПараметр("СПостащиком"		, ПараметрыОтбора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции

#КонецЕсли
